grembo/freebsd_c720/share/man/man4/cyapa.4
.\" Copyright (c) 2015 Michael Gmelin <freebsd@grem.de>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD: $
.\"
.Dd January 4, 2015
.Dt CYAPA 4
.Os
.Sh NAME
.Nm cyapa
.Nd Cypress APA trackpad with I2C interface driver
.Sh SYNOPSIS
To compile this driver into the kernel, place the following lines into
your kernel configuration file:
.Bd -ragged -offset indent
.Cd "device cyapa"
.Cd "device ig4"
.Cd "device smbus"
.Ed
.Pp
Alternatively, to load the driver as a module at boot time, place the following line in
.Xr loader.conf 5 :
.Bd -literal -offset indent
cyapa_load="YES"
ig4_load="YES"
.Ed
.Sh DESCRIPTION
The
.Nm
driver provides support for the Cypress APA trackpad. It emulates
the IntelliMouse PS/2 protocol. It supports basic mouse ioctls, so that
.Xr moused 8
is supported properly.
.Ss Trackpad layout
.Bd -literal

                   2/3               1/3
          +--------------------+------------+
          |                    |   Middle   |
          |                    |   Button   |
          |       Left         |            |
          |      Button        +------------+
          |                    |   Right    |
          |                    |   Button   |
          +--------------------+............|
          |     Thumb/Button Area           | 15%
          +---------------------------------+
.Ed
.Ss Trackpad features
.Bl -tag -width "debug.cyapa_thumbarea_percent"
.It Va Two finger scrolling
Use two fingers for Z axis scrolling.
.It Va Button down/second finger
While one finger clicks and holds down the touchpad, the second one can be
used to move the mouse cursor.  Useful for drawing or selecting text.
.It Va Thumb/Button Area
The lower 15% of the trackpad will not affect the mouse cursor position.
This allows for high precision clicking, by controlling the cursor with the
index finger and pushing/holding the pad down with the thumb.
.It Va Trackpad button
Push physical button. Left 2/3rds of the pad will issue a LEFT button event,
upper right corner will issue a MIDDLE button event, lower right corner will
issue a RIGHT button.
.El
.Sh SYSCTL VARIABLES
The following
.Xr sysctl 8
variables are available:
.Bl -tag -width "debug.cyapa_thumbarea_percent"
.It Va debug.cyapa_idle_freq
Scan frequence in idle mode (default is 1).
.It Va debug.cyapa_slow_freq
Scan frequence in slow mode (default is 20).
.It Va debug.cyapa_norm_freq
Scan frequence in normal mode (default is 100).
.It Va debug.cyapa_minpressure
Minimum pressure to detect a finger (default is 12).
.It Va debug.cyapa_scroll_wait_ms
Milliseconds to wait before starting to scroll (default is 50).
.It Va debug.cyapa_scroll_stick_ms
Milliseconds to prevent cursor move on single finger after scroll (default is 150).
.It Va debug.cyapa_rest_ms
Milliseconds to detect resting cursor (default is 50).
.It Va debug.cyapa_thumbarea_percent
Size of bottom thumb area in percent (default is 15).
.It Va debug.cyapa_debug
Setting this to a non-zero enables debug output to console and syslog.
.It Va debug.cyapa_reset
Reinitialize the device.
.El
.Sh FILES
.Nm
creates
.Pa /dev/cyapa0 ,
which presents the mouse as an
.Ar IntelliMouse PS/2
type device. It supports
.Xr moused 8
level 0 and level 2 (level 1 will be used by default).
.Sh EXAMPLES
To use
.Nm
with
.Xr moused 8
add the following lines to the
.Xr rc.conf 5
file:
.Pp
.Dl moused_enable="YES"
.Dl moused_port="/dev/cyapa0"
.Pp
If you prefer no vertical scrolling support also add
.Pp
.Dl moused_flags="-l0"
.Sh SEE ALSO
.Xr ig4 4 ,
.Xr moused 4 ,
.Xr smbus 4
.Xr sysmouse 4
.Sh AUTHORS
.An -nosplit
The original
.Nm
driver was written for DragonFly BSD by
.An Matthew Dillon .
.Pp
It has been ported, changed and enhanced for
.Fx
by
.An Michael Gmelin Aq Mt freebsd@grem.de .
.Pp
This manual page was written by
.An Michael Gmelin Aq Mt freebsd@grem.de .
